# Começando o melhor trabalho da turma que andre disse!!

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('./GSAF5.csv', sep=',',encoding='latin-1')

In [3]:
df.shape

(5992, 24)

In [4]:
df.head(2)

,Case Number,Date,Year,Type,Country,Area,Location,Activity,Name,Sex,...,Species,Investigator or Source,pdf,href formula,href,Case Number.1,Case Number.2,original order,Unnamed: 22,Unnamed: 23
0,2016.09.18.c,18-Sep-16,2016,Unprovoked,USA,Florida,"New Smyrna Beach, Volusia County",Surfing,male,M,...,NaN,"Orlando Sentinel, 9/19/2016",2016.09.18.c-NSB.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2016.09.18.c,2016.09.18.c,5993,NaN,NaN
1,2016.09.18.b,18-Sep-16,2016,Unprovoked,USA,Florida,"New Smyrna Beach, Volusia County",Surfing,Chucky Luciano,M,...,NaN,"Orlando Sentinel, 9/19/2016",2016.09.18.b-Luciano.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2016.09.18.b,2016.09.18.b,5992,NaN,NaN

##  Perguntas pra gente basear a limpeza dos dados

In [5]:
print('''Perguntas:
1 - Quais as 3 especies de tubarões mais fatais?
2 - Qual o sexo que tem mais vitimas de tubarões?
3 - Qual o pais em que os tubarões são mais fatais?
''')

Perguntas:
1 - Quais as 3 especies de tubarões mais fatais?
2 - Qual o sexo que tem mais vitimas de tubarões?
3 - Qual o pais em que os tubarões são mais fatais?

### Abaixo começa nosso data cleaning e arrumação dos dados

In [6]:
df.columns=[column.strip() for column in df]

In [7]:
df.columns

Index(['Case Number', 'Date', 'Year', 'Type', 'Country', 'Area', 'Location',
       'Activity', 'Name', 'Sex', 'Age', 'Injury', 'Fatal (Y/N)', 'Time',
       'Species', 'Investigator or Source', 'pdf', 'href formula', 'href',
       'Case Number.1', 'Case Number.2', 'original order', 'Unnamed: 22',
       'Unnamed: 23'],
      dtype='object')

In [8]:
df_filtrado=df.loc[:,['Fatal (Y/N)','Sex','Country','Species']]
df_filtrado

     Fatal (Y/N) Sex             Country    Species
0              N   M                 USA        NaN
1              N   M                 USA        NaN
2              N   M                 USA        NaN
3              N   M           AUSTRALIA        NaN
4              N   M           AUSTRALIA  2 m shark
...          ...  ..                 ...        ...
5987           Y   M           AUSTRALIA        NaN
5988           Y   M           AUSTRALIA        NaN
5989           Y   M                 USA        NaN
5990           Y   M              PANAMA        NaN
5991           Y   M  CEYLON (SRI LANKA)        NaN

[5992 rows x 4 columns]

# Cleaning column sex (Question 1)
We are reducing the columns we are manipulating to get a better understanding of the data

In [9]:
df_sex=df_filtrado[['Sex','Fatal (Y/N)']]

In [10]:
df_sex.head(3)

  Sex Fatal (Y/N)
0   M           N
1   M           N
2   M           N

In [11]:
#Verifying distinct values:
df_sex['Sex'].unique()

array(['M', nan, 'F', 'M ', 'lli', 'N', '.'], dtype=object)

In [12]:
#Removing spaces from strings and replacing NaN for 0 (We are assuming the 'N' is meant to be 'M')
df_sex['Sex']=[item.upper().strip() if type(item)==str else 0 for item in df_sex['Sex']]

/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [13]:
#Checking if code worked as expected
df_sex['Sex'].unique()

array(['M', 0, 'F', 'LLI', 'N', '.'], dtype=object)

In [14]:
df_sex['Sex']=['M' if item=='N' else item for item in df_sex['Sex']]

/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [15]:
#Checking if code worked as expected
df_sex['Sex'].unique()

array(['M', 0, 'F', 'LLI', '.'], dtype=object)

In [16]:
#Changing  misstypes for 0 (Considering only M and F)
df_sex['Sex']=[item if (item=='M')|(item=='F') else 0 for item in df_sex['Sex']]

/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [17]:
#Checking if code worked as expected
df_sex['Sex'].unique()

array(['M', 0, 'F'], dtype=object)

In [18]:
df_sex.head(4)

  Sex Fatal (Y/N)
0   M           N
1   M           N
2   M           N
3   M           N

In [19]:
#Changing all the data not related (not a missclick) we found for 0
df_sex['Sex']=[item if (item=='M')|(item=='F') else 0 for item in df_sex['Sex']]

/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [20]:
#Removing all lines that has the '0' as key for the column 'Sex', cause it is not 
#measuring anything, once we don't know if the Shark was male or femle.
mask1 = (df_sex['Sex'] == 'F') | (df_sex['Sex']=='M')

In [21]:
mask1

0       True
1       True
2       True
3       True
4       True
        ...
5987    True
5988    True
5989    True
5990    True
5991    True
Name: Sex, Length: 5992, dtype: bool

In [22]:
index_sex = df_sex.loc[~mask1,:].index

In [23]:
df_sex_filtered = df_sex.drop(index_sex)

In [24]:
df_sex_filtered

     Sex Fatal (Y/N)
0      M           N
1      M           N
2      M           N
3      M           N
4      M           N
...   ..         ...
5987   M           Y
5988   M           Y
5989   M           Y
5990   M           Y
5991   M           Y

[5423 rows x 2 columns]

## Cleaning column 'Fatal (Y/N)' (Questions 1 and 2)¶
At this moment, we already have the data for column "Sex" ready to compare, so we are doing the same for column"Fatal (Y/N)"

In [25]:
df_fatal=df_sex_filtered

In [26]:
x = 'Fatal (Y/N)'

In [27]:
df_fatal[x].unique()

array(['N', 'Y', nan, 'UNKNOWN', ' N', '#VALUE!'], dtype=object)

In [28]:
df_fatal.head()

  Sex Fatal (Y/N)
0   M           N
1   M           N
2   M           N
3   M           N
4   M           N

In [29]:
#Removing spaces from strings and replacing NaN for 0 (We disconsidering all the 
#misspelling data from this DF')
df_fatal[x]=[item.upper().strip() if type(item)==str else 0 for item in df_fatal[x]]

In [30]:
df_fatal[x]

0       N
1       N
2       N
3       N
4       N
       ..
5987    Y
5988    Y
5989    Y
5990    Y
5991    Y
Name: Fatal (Y/N), Length: 5423, dtype: object

In [31]:
df_fatal[x].unique()

array(['N', 'Y', 0, 'UNKNOWN', '#VALUE!'], dtype=object)

In [32]:
#Changing all the data not related (not a missclick) we found for 0
df_fatal[x]=[item if (item=='Y')|(item=='N') else 0 for item in df_fatal[x]]

In [33]:
df_fatal[x].unique()

array(['N', 'Y', 0], dtype=object)

In [34]:
df_fatal.head()

  Sex Fatal (Y/N)
0   M           N
1   M           N
2   M           N
3   M           N
4   M           N

In [35]:
#Removing all lines that has the '0' as key for the column 'Sex', cause it is not 
#measuring anything, once we don't know if the Shark was male or female.
mask2 = (df_fatal[x] == 'Y') | (df_fatal[x]=='N')

In [36]:
mask2

0       True
1       True
2       True
3       True
4       True
        ...
5987    True
5988    True
5989    True
5990    True
5991    True
Name: Fatal (Y/N), Length: 5423, dtype: bool

In [37]:
index_fatal = df_fatal.loc[~mask2,:].index

In [38]:
df_fatal_filtered = df_fatal.drop(index_fatal)

In [39]:
df_fatal_filtered

     Sex Fatal (Y/N)
0      M           N
1      M           N
2      M           N
3      M           N
4      M           N
...   ..         ...
5987   M           Y
5988   M           Y
5989   M           Y
5990   M           Y
5991   M           Y

[5356 rows x 2 columns]

In [40]:
df_fatal_filtered=df_fatal_filtered.reset_index(drop=True)

In [41]:
df_fatal_filtered

     Sex Fatal (Y/N)
0      M           N
1      M           N
2      M           N
3      M           N
4      M           N
...   ..         ...
5351   M           Y
5352   M           Y
5353   M           Y
5354   M           Y
5355   M           Y

[5356 rows x 2 columns]

In [42]:
df_fatal_filtered.groupby(by=['Sex','Fatal (Y/N)'])['Sex'].count()

Sex  Fatal (Y/N)
F    N               456
     Y               123
M    N              3492
     Y              1285
Name: Sex, dtype: int64

In [43]:
df_Country=df.loc[:,['Country']]

In [44]:
df_Country

                 Country
0                    USA
1                    USA
2                    USA
3              AUSTRALIA
4              AUSTRALIA
...                  ...
5987           AUSTRALIA
5988           AUSTRALIA
5989                 USA
5990              PANAMA
5991  CEYLON (SRI LANKA)

[5992 rows x 1 columns]